testdata/IN_2023_02/Roundtrip/partner/20160801_gesellschaftsstruktur_keine_steuerpflicht_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        
      <tarif:Request>
            
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
          
        <tarif:Tarifierung>
              
          <gevo:Vermittler>
                  
            <allg:Vermittlernummer>111/222</allg:Vermittlernummer>
                
          </gevo:Vermittler>
              
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
                  
            <basis:Erweiterung xsi:type="vbl:CT_JuristischePersonErweiterung">
                      
              <vbl:Gesellschaftsstruktur>
                          
                <vbl:SteuerpflichtInDenUSA>false</vbl:SteuerpflichtInDenUSA>
                          
                <vbl:GIIN>ABC123.DEF45.GH.678</vbl:GIIN>
                          
                <vbl:HandelAnWertpapierboerse>true</vbl:HandelAnWertpapierboerse>
                          
                <vbl:EinkuenfteAusVermoegensverwaltung>true</vbl:EinkuenfteAusVermoegensverwaltung>
                        
              </vbl:Gesellschaftsstruktur>
                    
            </basis:Erweiterung>
                  
            <partner:Anrede>3</partner:Anrede>
                  
            <partner:PartnerID>1</partner:PartnerID>
                
          </tarif:Partner>
              
          <tarif:Partner xsi:type="partner:CT_Person">
                  
            <partner:Name>Wirt. Berechtigter Name 1</partner:Name>
                  
            <partner:PartnerID>2</partner:PartnerID>
                  
            <partner:Partnerbeziehung>
                      
              <partner:PartnerID>1</partner:PartnerID>
                      
              <partner:Art xsi:type="vbl:STE_PartnerbeziehungErweitert">WirtschaftlichBerechtigter</partner:Art>
                    
            </partner:Partnerbeziehung>
                  
            <partner:Vorname>Wirt. Berechtigter Vorname 1</partner:Vorname>
                
          </tarif:Partner>
              
          <tarif:Partner xsi:type="partner:CT_Person">
                  
            <partner:Anrede>1</partner:Anrede>
                  
            <partner:PartnerID>3</partner:PartnerID>
                  
            <partner:Anschrift>
                      
              <allg:Landname>Deutschland</allg:Landname>
                      
              <partner:ArtID>1</partner:ArtID>
                    
            </partner:Anschrift>
                  
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risikopruefung"/>
                  
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
             
      
            <partner:Geschlecht>1</partner:Geschlecht>
                  
            <partner:Staatsangehoerigkeit>D</partner:Staatsangehoerigkeit>
                
          </tarif:Partner>
              
          <tarif:Versicherungsnehmer>
                  
            <partner:PartnerID>1</partner:PartnerID>
                
          </tarif:Versicherungsnehmer>
              
          <tarif:Verkaufsprodukt>
                  
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                      
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                          
                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                        
              </basis:Erweiterung>
                      
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                      
              <pm:Beitrag>
                          
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                          
                <pm:Betrag>
                              
                  <allg:Betrag>800</allg:Betrag>
                              
                  <allg:Waehrung>EUR</allg:Waehrung>
                            
                </pm:Betrag>
                          
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                        
              </pm:Beitrag>
                      
              <pm:Versicherungsdauer>
                          
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                 
        
              </pm:Versicherungsdauer>
                      
              <pm:Kennung>FR</pm:Kennung>
                      
              <pm:Elementarprodukt xsi:type="pm-leben:CT_KapitalbildendeVersicherung">
                          
                <pm:Versicherungsdauer>
                              
                  <allg:AnzahlJahre>35</allg:AnzahlJahre>
                            
                </pm:Versicherungsdauer>
                          
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                          
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">12</pm-leben:UeberschussverwendungVorLeistung>
                          
                <pm-leben:VersichertePerson>
                              
                  <partner:PartnerID>3</partner:PartnerID>
                            
                </pm-leben:VersichertePerson>
                        
              </pm:Elementarprodukt>
                      
              <pm-leben:VorgabeBerechnung>
                          
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                          
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                        
              </pm-leben:VorgabeBerechnung>
                    
            </pm:Produkt>
                
          </tarif:Verkaufsprodukt>
            
        </tarif:Tarifierung>
          
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
